// *++
//
// Copyright (c) 2004 - 2013, Intel Corporation. All rights reserved.<BR>
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   SetupBrowserStr.uni
//
// Abstract:
//
//   String definitions for Browser.
//
// --*/


/=#

#langdef en-US "English"
#langdef fr-FR "Français"
#langdef zh-Hans "\wide中文\narrow"


#string ENTER_STRING                   #language en-US  "<Enter>=Select Entry"
                                       #language fr-FR  "<Enter>=Choisir l'Entrée"
                                       #language zh-Hans  "<Enter>=Select Entry"
#string ENTER_COMMIT_STRING            #language en-US  "<Enter>=Complete Entry"
                                       #language fr-FR  "<Enter>=Compléter l'Entrée"
                                       #language zh-Hans  "<Enter>=Complete Entry"                                       
#string ENTER_ESCAPE_STRING            #language en-US  "Esc=Exit Entry"
                                       #language fr-FR  "Esc=Sortir l'Entrée"
                                       #language zh-Hans  "Esc=Exit Entry"
#string ESCAPE_STRING                  #language en-US  "Esc=Exit"
                                       #language fr-FR  "Esc=Sortir"
                                       #language zh-Hans  "Esc=Exit"  
#string ADJUST_NUMBER                  #language en-US  "+/- =Adjust Value"
                                       #language fr-FR  "+/- =Ajuster la valeur"
                                       #language zh-Hans  "+/- =Adjust Value"                                         
#string PLUS_STRING                    #language en-US  "+ =Move Selection Up"
                                       #language fr-FR  "+ =Relever le choix"
                                       #language zh-Hans	"+ =Move Selection Up"                                         
#string MINUS_STRING                   #language en-US  "- =Move Selection Down"
                                       #language fr-FR  "- =Abaisser le choix"
                                       #language zh-Hans	"- =Move Selection Down"  
#string MOVE_HIGHLIGHT                 #language en-US  "=Move Highlight"
                                       #language fr-FR  "=Essentiel de mouvement"
                                       #language zh-Hans	"=Move Highlight"  
#string DEC_NUMERIC_INPUT              #language en-US  "0123456789 are valid inputs"
                                       #language fr-FR  "0123456789 sont des données valides"
                                       #language zh-Hans	"0123456789 are valid inputs"  
#string HEX_NUMERIC_INPUT              #language en-US  "0-9 a-f are valid inputs"
                                       #language fr-FR  "0-9 a-f sont des données valides"
                                       #language zh-Hans 	"0-9 a-f are valid inputs"  
#string TOGGLE_CHECK_BOX               #language en-US  "<Spacebar>Toggle Checkbox"
                                       #language fr-FR  "<Spacebar>Bascule la Case de pointage"
                                       #language zh-Hans	"<Spacebar>Toggle Checkbox"                                         
#string NV_UPDATE_MESSAGE              #language en-US  "Configuration changed"
                                       #language fr-FR  "Configuration changed"
                                       #language zh-Hans	"Configuration changed"  
#string INPUT_ERROR_MESSAGE            #language en-US  "!!"
                                       #language fr-FR  "!!"
                                       #language zh-Hans	"!!"  
#string EMPTY_STRING                   #language en-US  ""
                                       #language fr-FR  ""
                                       #language zh-Hans	""  
#string ARE_YOU_SURE_YES               #language en-US  "Y"
                                       #language fr-FR  "Y"
                                       #language zh-Hans	"Y"  
#string ARE_YOU_SURE_NO                #language en-US  "N"
                                       #language fr-FR  "N"
                                       #language zh-Hans	"N"  
#string SAVE_CHANGES                   #language en-US  "Changes have not saved. Save Changes and exit?"
                                       #language fr-FR  "Enregistrer les modifications et quitter?"
                                       #language zh-Hans	"\wide设置未被保存，保存并且退出\narrow?"                                         
#string ARE_YOU_SURE                   #language en-US  "Press 'Y' to confirm, 'N' to ignore."
                                       #language fr-FR  "Press 'Y' to confirm, 'N' to ignore."
                                       #language zh-Hans	"'Y'\wide确认，\narrow'N'\wide取消\narrow."   
                                       
#string BYO_COPY_RIGHT                 #language en-US  "Byosoft BIOS Setup Utility"
                                       #language zh-Hans  "\wide百敖固件配置程序\narrow"
#string BYO_FUNCTION_KEY_ONE           #language en-US  "F1"
                                       #language zh-Hans  "F1"
#string BYO_FUNCTION_KEY_ONE_HELP      #language en-US  "Help"
                                       #language zh-Hans "\wide帮助\narrow" 
#string BYO_KEY_PLUS_AND_MINUS         #language en-US  "-/+"
                                       #language zh-Hans  "-/+"
#string BYO_KEY_PLUS_AND_MINUS_HELP    #language en-US  "Change Value"
                                       #language zh-Hans "\wide更改设置\narrow" 
#string BYO_FUNCTION_KEY_NINE          #language en-US  "F9"
                                       #language zh-Hans  "F9"
#string BYO_FUNCTION_KEY_NINE_HELP     #language en-US  "Setup Defaults"
                                       #language zh-Hans "\wide默认值\narrow" 

#string BYO_FUNCTION_KEY_ESC           #language en-US  "Esc"
                                       #language zh-Hans  "Esc"
#string BYO_FUNCTION_KEY_ESC_HELP      #language en-US  "Exit"
                                       #language zh-Hans "\wide退出\narrow" 
#string BYO_FUNCTION_KEY_ENTER         #language en-US  "Enter"
                                       #language zh-Hans  "Enter"
#string BYO_FUNCTION_KEY_ENTER_HELP    #language en-US  "Select►Sub-Menu"
                                       #language zh-Hans "\wide选择子菜单\narrow" 
#string BYO_FUNCTION_KEY_TEN           #language en-US  "F10"
                                       #language zh-Hans	"F10"  
#string BYO_FUNCTION_KEY_TEN_HELP      #language en-US  "Save & Exit"
                                       #language zh-Hans "\wide保存并退出\narrow" 
#string BYO_KEY_UP_DOWN_HELP           #language en-US  "Select Item"  
                                       #language zh-Hans	"\wide选项条目\narrow"
#string BYO_KEY_LEFT_RIGHT_HELP        #language en-US  "Move Menu"
                                       #language zh-Hans "\wide选择菜单\narrow" 
#string BYO_HELP_MESSAGE               #language en-US  "Help Message"
                                       #language zh-Hans "\wide帮助信息\narrow" 
#string BYO_SELECT_MENU_HELP           #language en-US  "Select Menu"
                                       #language zh-Hans "\wide选择菜单\narrow" 
#string BYO_GENERAL_HELP               #language en-US  "General Help"
                                       #language zh-Hans	"\wide常规帮助\narrow"  
#string BYO_GENERAL_HELP_1             #language en-US  "F1  Help             -/+   Change Value"
                                       #language zh-Hans  "F1  \wide帮助\narrow             -/+   更改设置"
#string BYO_GENERAL_HELP_2             #language en-US  "F9  Restore Default  Enter Enter Sub Menu"
                                       #language zh-Hans  "F9  \wide默认值\narrow           Enter \wide选择子菜单\narrow"
#string BYO_GENERAL_HELP_3             #language en-US  "F10 Save & Exit      Esc    Exit"
                                       #language zh-Hans  "F10 \wide保存并退出\narrow       Esc   \wide退出\narrow"
#string BYO_CONTINUE                   #language en-US  "[Continue]"
                                       #language zh-Hans "[\wide继续\narrow]" 
